china = {
        "北京": {
            "一号线": ["四惠", "大望路", "天安门", "西单"],
            "二号线": ["北京站", "朝阳门", "东直门", "西直门"],
            "三号线": ["国贸", "三元桥", "知春路", "巴沟"]
            },
        "上海": {
            "四号线": ["徐家汇", "人民广场", "延长路", "共康路", "呼兰路"],
            "五号线": ["东昌路", "静安寺", "江苏路", "虹桥火车站"],
            "六号线": ["宝山路", "赤峰路", "曹阳路", "虹桥路", "宜山路"]
            },
        "广州": {
            "七号线": ["东山口", "农讲所", "烈士陵园", "公园前", "体育西路"],
            "八号线": ["黄边", "纪念堂", "三元里", "白云公园"],
            "九号线": ["沙河顶", "北京路", "一德路", "文化公园"]
            },
        "深圳": {
            "一号线": ["高新园", "桃园", "白石洲", "华侨城"],
            "四号线": ["白石龙", "明乐", "少年宫", "红山"],
            "五号线": ["大学城", "兴东", "西里", "深圳北站"]
            },
        }
temp = china
stack_level=[]
while True:
    for i in temp:
        print(i)
    choice = input(">>>>")
    if choice in temp:
        if type(temp) != list:
            stack_level.append(temp)
            temp = temp[choice]
    elif choice == 'q':
        exit()
    elif choice == 'b':
        if len(stack_level) != 0:
            temp = stack_level.pop()
    else:
        print("输入错误")
